MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F415ZG/mcu.h
    /** @brief Control register */
    union
    {
        __IOM uint32_t CFG;
        struct
        {
            __IOM uint32_t SLEEP_CLK_STS   : 1;
            __IOM uint32_t STOP_CLK_STS    : 1;
            __IOM uint32_t STANDBY_CLK_STS : 1;
            __IM  uint32_t RESERVED1       : 2;
            __IOM uint32_t TRACE_IOEN      : 1;
            __IOM uint32_t TRACE_MODE      : 2;
            __IM  uint32_t RESERVED2       : 24;
        } CFG_B;
    };

    /** @brief APB1F register */
    union
    {
        __IOM uint32_t APB1F;
        struct
        {
            __IOM uint32_t TMR2_STS                  : 1;
            __IOM uint32_t TMR3_STS                  : 1;
            __IOM uint32_t TMR4_STS                  : 1;
            __IOM uint32_t TMR5_STS                  : 1;
            __IOM uint32_t TMR6_STS                  : 1;
            __IOM uint32_t TMR7_STS                  : 1;
            __IOM uint32_t TMR12_STS                 : 1;
            __IOM uint32_t TMR13_STS                 : 1;
            __IOM uint32_t TMR14_STS                 : 1;
            __IM  uint32_t RESERVED1                 : 1;
            __IOM uint32_t RTC_STS                   : 1;
            __IOM uint32_t WWDT_STS                  : 1;
            __IOM uint32_t IWDT_STS                  : 1;
            __IM  uint32_t RESERVED2                 : 8;
            __IOM uint32_t I2C1_SMBUS_TIMEOUT_STS    : 1;
            __IOM uint32_t I2C2_SMBUS_TIMEOUT_STS    : 1;
            __IOM uint32_t I2C3_SMBUS_TIMEOUT_STS    : 1;
            __IM  uint32_t RESERVED3                 : 1;
            __IOM uint32_t CAN1_STS                  : 1;
            __IOM uint32_t CAN2_STS                  : 1;
            __IM  uint32_t RESERVED4                 : 5;
        } APB1F_B;
    };

    /** @brief APB2F register */
    union
    {
        __IOM uint32_t APB2F;
        struct
        {
            __IOM uint32_t TMR1_STS                  : 1;
            __IOM uint32_t TMR8_STS                  : 1;
            __IM  uint32_t RESERVED1                 : 14;
            __IOM uint32_t TMR9_STS                  : 1;
            __IOM uint32_t TMR10_STS                 : 1;
            __IOM uint32_t TMR11_STS                 : 1;
            __IM  uint32_t RESERVED2                 : 23;
        } APB2F_B;
    };
} DBGMCU_T;

/**
 * @brief System configuration controller (SYSCFG)
 */
typedef struct
{
    union
    {
        __IOM uint32_t MMSEL;

        struct
        {
            __IOM uint32_t MMSEL         : 2;
            __IM  uint32_t RESERVED      : 30;
        } MMSEL_B;
    };
    /** @brief Peripheral Mode Configuration register */
    union
    {
        __IOM uint32_t PMCFG;

        struct
        {
            __IM  uint32_t RESERVED1        : 23;
            __IOM uint32_t ENETSEL          : 1;
            __IM  uint32_t RESERVED2        : 8;
        } PMCFG_B;
    };

    /** @brief External Interrupt Configuration register1 */
    union
    {
        __IOM uint32_t EINTCFG1;

        struct
        {
            __IOM uint32_t EINT0           : 4;
            __IOM uint32_t EINT1           : 4;
            __IOM uint32_t EINT2           : 4;
            __IOM uint32_t EINT3           : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG1_B;
    };

    /** @brief External Interrupt Configuration register2 */
    union
    {
        __IOM uint32_t EINTCFG2;

        struct
        {
            __IOM uint32_t EINT4           : 4;
            __IOM uint32_t EINT5           : 4;
            __IOM uint32_t EINT6           : 4;
            __IOM uint32_t EINT7           : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG2_B;
    };

    /** @brief External Interrupt Configuration register3 */
    union
    {
        __IOM uint32_t EINTCFG3;

        struct
        {
            __IOM uint32_t EINT8           : 4;
            __IOM uint32_t EINT9           : 4;
            __IOM uint32_t EINT10          : 4;
            __IOM uint32_t EINT11          : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG3_B;
    };

    /** @brief External Interrupt Configuration register4 */
    union
    {
        __IOM uint32_t EINTCFG4;

        struct
        {
            __IOM uint32_t EINT12          : 4;
            __IOM uint32_t EINT13          : 4;
            __IOM uint32_t EINT14          : 4;
            __IOM uint32_t EINT15          : 4;
            __IM  uint32_t RESERVED        : 16;
        } EINTCFG4_B;
    };

    __IM  uint32_t  RESERVED[2];

    /** @brief Compensation cell control register */
    union
    {
        __IOM uint32_t CCCTRL;

        struct
        {
            __IOM uint32_t CCPD            : 1;
            __IM uint32_t RESERVED1        : 7;
            __IM uint32_t RDYFLG           : 1;
            __IM  uint32_t RESERVED        : 23;
        } CCCTRL_B;
    };
} SYSCFG_T;

/**
 * @brief    CRYP register (CRYP)
 */
typedef struct
{
    /** @brief Control register  */
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IM  uint32_t RESERVED1       : 2;
            __IOM uint32_t ALGODIRSEL      : 1;
            __IOM uint32_t ALGOMSEL        : 3;
            __IOM uint32_t DTSEL           : 2;
            __IOM uint32_t KSIZESEL        : 2;
            __IM  uint32_t RESERVED2       : 4;
            __IOM uint32_t FFLUSH          : 1;
            __IOM uint32_t CRYPEN          : 1;
            __IM  uint32_t RESERVED3       : 16;
        } CTRL_B;
    } ;

    /** @brief Status register */
    union
    {
        __IM uint32_t STS;

        struct
        {
            __IM  uint32_t IFEMPT         : 1;
            __IM  uint32_t IFFULL         : 1;
            __IM  uint32_t OFEMPT         : 1;
            __IM  uint32_t OFFULL         : 1;
            __IM  uint32_t BUSY           : 1;
            __IM  uint32_t RESERVED       : 27;
        } STS_B;
    };

    /** @brief Input data register */
    union
    {
        __IOM uint32_t DATAIN;

        struct
        {
            __IOM uint32_t DATAIN          : 32;
        } DATAIN_B;
    };

    /** @brief Output data register */
    union
    {
        __IM uint32_t DATAOUT;

        struct
        {
            __IM uint32_t DATAOUT          : 32;
        } DATAOUT_B;
    };

    /** @brief Control DMA register */
    union
    {
        __IOM uint32_t DMACTRL;

        struct
        {
            __IOM uint32_t INEN             : 1;
            __IOM uint32_t OUTEN            : 1;
            __IM  uint32_t RESERVED         : 30;
        } DMACTRL_B;
    };

    /** @brief Service Interrupt Mask register */
    union
    {
        __IOM uint32_t INTMASK;

        struct
        {
            __IOM uint32_t INIMASK          : 1;
            __IOM uint32_t OUTIMASK         : 1;
            __IM  uint32_t RESERVED         : 30;
        } INTMASK_B;
    };

