MikroElektronika/core_packages/ARM/gcc_clang/def/geehy/APM32F415ZG/mcu.h
    /** @brief Service Raw Interrupt Status register */
    union
    {
        __IM uint32_t INTSTS;

        struct
        {
            __IM uint32_t INISTS            : 1;
            __IM uint32_t OUTISTS           : 1;
            __IM  uint32_t RESERVED         : 30;
        } INTSTS_B;
    };

    /** @brief Service Masked Interrupt Status register */
    union
    {
        __IOM uint32_t MINTSTS;

        struct
        {
            __IOM uint32_t INMISTS           : 1;
            __IOM uint32_t OUTMISTS          : 1;
            __IM  uint32_t RESERVED          : 30;
        } MINTSTS_B;
    };

    /** @brief Key0L register */
    union
    {
        __OM uint32_t K0L;

        struct
        {
            __OM  uint32_t Bx         : 32;
        } K0L_B;
    };

    /** @brief Key0R register */
    union
    {
        __OM uint32_t K0R;

        struct
        {
            __OM  uint32_t Bx         : 32;
        } K0R_B;
    };

    /** @brief Key1L register */
    union
    {
        __OM uint32_t K1L;

        struct
        {
            __OM  uint32_t KyBx         : 32;
        } K1L_B;
    };

    /** @brief Key1R register */
    union
    {
        __OM uint32_t K1R;

        struct
        {
            __OM  uint32_t KyBx         : 32;
        } K1R_B;
    };

    /** @brief Key2L register */
    union
    {
        __OM uint32_t K2L;

        struct
        {
            __OM  uint32_t KyBx         : 32;
        } K2L_B;
    };

    /** @brief Key2R register */
    union
    {
        __OM uint32_t K2R;

        struct
        {
            __OM  uint32_t KyBx         : 32;
        } K2R_B;
    };

    /** @brief Key3L register */
    union
    {
        __OM uint32_t K3L;

        struct
        {
            __OM  uint32_t KyBx         : 32;
        } K3L_B;
    };

    /** @brief Key3R register */
    union
    {
        __OM uint32_t K3R;

        struct
        {
            __OM  uint32_t KyBx         : 32;
        } K3R_B;
    };

    /** @brief Initialize the vector register register */
    union
    {
        __IOM uint32_t IV0L;

        struct
        {
            __IOM  uint32_t IVx         : 32;
        } IV0L_B;
    };

    /** @brief Initialize the vector register register */
    union
    {
        __IOM uint32_t IV0R;

        struct
        {
            __IOM  uint32_t IVx         : 32;
        } IV0R_B;
    };

    /** @brief Initialize the vector register register */
    union
    {
        __IOM uint32_t IV1L;

        struct
        {
            __IOM  uint32_t IVx         : 32;
        } IV1L_B;
    };

    /** @brief Initialize the vector register register */
    union
    {
        __IOM uint32_t IV1R;

        struct
        {
            __IOM  uint32_t IVx         : 32;
        } IV1R_B;
    };

} CRYP_T;

/**
* @brief The registers of HASH
*/
typedef struct
{
    /** @brief HASH Control register */
    union
    {
        __IOM uint32_t CTRL;
        struct
        {
            __IM  uint32_t RESERVED        : 2;
            __IOM uint32_t INITCAL         : 1;
            __IOM uint32_t DMAEN           : 1;
            __IOM uint32_t DTYPE           : 2;
            __IOM uint32_t MODESEL         : 1;
            __IOM uint32_t ALGSEL          : 1;
            __IOM uint32_t WNUM            : 4;
            __IOM uint32_t DINNEMPT        : 1;
            __IM  uint32_t RESERVED1       : 3;
            __IOM uint32_t LKEYSEL         : 1;
            __IM  uint32_t RESERVED2       : 15;
        } CTRL_B;
    };

    /** @brief HASH Input Data register */
    union
    {
        __IOM uint32_t INDATA;
        struct
        {
            __IOM uint32_t INDATA         : 32;
        } INDATA_B;
    };

    /** @brief HASH Start register */
    union
    {
        __IOM uint32_t START;
        struct
        {
            __IOM uint32_t LWNUM          : 5;
            __IM  uint32_t RESERVED1      : 3;
            __OM  uint32_t DIGCAL         : 1;
            __IM  uint32_t RESERVED2      : 23;
        } START_B;
    };

    __IO uint32_t DIG[5];

    /** @brief HASH interrupt enable register */
    union
    {
        __IOM uint32_t INT;
        struct
        {
            __IOM uint32_t INDATA         : 1;
            __IOM uint32_t DCALC          : 1;
            __IM  uint32_t RESERVED1      : 30;
        } INT_B;
    };

    /** @brief HASH status register */
    union
    {
        __IOM uint32_t STS;
        struct
        {
            __IOM uint32_t INDATAINT      : 1;
            __IOM uint32_t DCALCINT       : 1;
            __IM  uint32_t DMA            : 1;
            __IM  uint32_t BUSY           : 1;
            __IM  uint32_t RESERVED       : 28;
        } STS_B;
    };

    __IM uint32_t RESERVED[52];

    /** @brief HASH context swap register */
    __IOM uint32_t CTSWAP[51];

} HASH_T;

/**
 * @brief    Random Number Generator (RNG)
 */
typedef struct
{
    union
    {
        __IOM uint32_t CTRL;

        struct
        {
            __IM   uint32_t RESERVED       : 2;
            __IOM  uint32_t RNGEN          : 1;
            __IOM  uint32_t INTEN          : 1;
            __IM   uint32_t RESERVED1      : 28;
        } CTRL_B;
    };

    union
    {
        __IOM uint32_t STS;

        struct
        {
            __IM   uint32_t DATARDY        : 1;
            __IM   uint32_t CLKERCSTS      : 1;
            __IM   uint32_t FSCSTS         : 1;
            __IM   uint32_t RESERVED1      : 2;
            __IOM  uint32_t CLKERINT       : 1;
            __IOM  uint32_t FSINT          : 1;
            __IM   uint32_t RESERVED2      : 25;
        } STS_B;
    };

    union
    {
        __IM uint32_t DATA;

        struct
        {
            __IM   uint32_t DATA           : 32;
        } DATA_B;
    };
} RNG_T;

/**
 * @brief    Big number module (BN)
 */
typedef struct
{
    /** Revision register */
    union
    {
        __IM uint32_t REV;

        struct
        {
            __IM   uint32_t MIN            : 8;
            __IM   uint32_t MID            : 8;
            __IM   uint32_t MAJ            : 8;
            __IM   uint32_t RESERVED       : 8;
        } REV_B;

